{
  "probability": 50,
  "isUnique": true,
  "description": "Controversies around Kachakonyan public broadcaster, PBK, are an everlasting part of our country's political scene. As the CEO of the company is supervised by the special body chosen directly by the parliament, ruling party has always the decisive voice regarding television's propaganda line. Under our party's former leader it was no different. The TV served as a tool to harden our iron electorate in their beliefs, but had the side-effect of deterring more unconvinced voters. As the new public media committee is to be chosen soon, we've got a chance to shuffle the things around but it will require dealing with our party's radical faction that supports current CEO.",
  "options": [
    {
      "description": "It's no point in making changes - they serve our rule well.",
      "effects": [
        {
          "type": "indicator_change",
          "change": 2,
          "indicator": "PartyCohesion"
        },
        {
          "type": "indicator_change",
          "change": 1,
          "indicator": "PartySupport"
        },
        {
          "type": "modifier_invocation",
          "name": "Powerful PBK CEO"
        }
      ]
    },
    {
      "description": "Change the chief so he doesn't gather too much power, but keep our propaganda line.",
      "effects": [
        {
          "type": "indicator_change",
          "change": 1,
          "indicator": "PartySupport"
        },
        {
          "type": "indicator_change",
          "change": -1,
          "indicator": "PartyCohesion"
        }
      ]
    },
    {
      "description": "Let's convince the current CEO that the slight change in methods is necessary.",
      "effects": [
        {
          "type": "indicator_change",
          "change": 1,
          "indicator": "PartySupport"
        },
        {
          "type": "media_takeover",
          "id": 4,
          "affiliation": "Neutral"
        },
        {
          "type": "modifier_invocation",
          "name": "Powerful PBK CEO"
        }
      ]
    },
    {
      "description": "If we want to keep influence even if our rule ends, we have to support our private media. Public broadcaster has to be more neutral and under new leadership.",
      "effects": [
        {
          "type": "indicator_change",
          "change": -2,
          "indicator": "PartyCohesion"
        },
        {
          "type": "media_takeover",
          "id": 4,
          "affiliation": "Neutral"
        }
      ]
    }
  ],
  "title": "State-sponsored propaganda"
}